# Cable Type Conductor Material Property

Source: https://www.revitapidocs.com/2026/a4434c41-3c6c-c765-8cfe-279964624a89.htm

---

| Cable Type Conductor Material Property |
| --- |

The Conductor Material of this Cable Type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId ConductorMaterial { get; set; }
```

```
Public Property ConductorMaterial As ElementId
	Get
	Set
```

```
public:
property ElementId^ ConductorMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member ConductorMaterial : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Material id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace